# 练习 6.1：⼈ 使⽤⼀个字典来存储⼀个⼈的信息，包括名、姓、年龄
# 和居住的城市。该字典应包含键 first_name、last_name、age 和
# city。将存储在该字典中的每项信息都打印出来
myself = {'first_name': 'Liu', 'last_name': 'zihuan','age': 23,'city':'WuHan'}
print(myself)

# 练习 6.2：喜欢的数 1 使⽤⼀个字典来存储⼀些⼈喜欢的数。请想出
# 5 个⼈的名字，并将这些名字⽤作字典中的键。再想出每个⼈喜欢的⼀
# 个数，并将这些数作为值存储在字典中。打印每个⼈的名字和喜欢的
# 数。为了让这个程序更有趣，通过询问朋友确保数据是真实的。
favorite_numbers = {
	'mine': 12,
	'mi': 10,
	'tan': 8,
	'lv': 12,
	'mom': 7
}

# 练习 6.3：词汇表 1 Python 字典可⽤于模拟现实⽣活中的字典。为避
# 免混淆，我们将后者称为词汇表。

# 想出你在前⾯学过的 5 个编程术语，将它们⽤作词汇表中的键，
# 并将它们的含义作为值存储在词汇表中。
word_list = {
	'code': '编码',
	'function': '函数',
	'block': '块',
	'dictionary': '字典',
	'slice': '切片'
}

# 以整洁的⽅式打印每个术语及其含义。为此，既可以先打印术
# 语，在它后⾯加上⼀个冒号，再打印其含义；也可以先在⼀⾏⾥
# 打印术语，再使⽤换⾏符（\n）插⼊⼀个空⾏，然后在下⼀⾏⾥
# 以缩进的⽅式打印其含义。
# *** 需要看完遍历字典的内容 ***
